{"author":[],"actions":[],"created_at":"2020-11-24T23:08:50.015Z","updated_at":"2020-11-24T23:10:24.198Z","created_by":"elastic","description":"OS signed binaries used by attackers to evade detection\nPowershell writing a file then running a process that is unsigned then where network event is true finally follow process tree until conhost.exe is spawned","enabled":true,"false_positives":[],"filters":[],"from":"now-7260s","id":"21ffc48c-01b5-45f1-ad81-908f0ad99ebb","immutable":false,"index":["logs-*","packetbeat-*","winlogbeat-*"],"interval":"1m","rule_id":"37d38fb0-6d62-45c7-96a8-959e0843c5ec","language":"eql","license":"","output_index":".siem-signals-default","max_signals":100,"risk_score":21,"risk_score_mapping":[],"name":"Adversary Emulation - Powershell Writing a File Until Conhost","query":"sequence by host.name\n  [process where event.type == \"start\"\n    and process.name in (\"powershell.exe\", \"mshta.exe\", \"installutil.exe\",  \"msxsl.exe\", \"rundll32.exe\") ]\n[file where file.extension == \"exe\"]\n[process where process.code_signature.status != \"trusted\" and event.type== \"start\"]\n  [network where true]\n  until \n[ process where process.name == \"conhost.exe\"]\n","references":[],"meta":{"from":"2h","kibana_siem_app_url":"https://1373244808184bb6b1e4a01986d646c1.australia-southeast1.gcp.elastic-cloud.com/app/security"},"severity":"low","severity_mapping":[],"updated_by":"elastic","tags":[],"to":"now","type":"eql","threat":[],"throttle":"no_actions","version":2,"exceptions_list":[]}
{"exported_count":1,"missing_rules":[],"missing_rules_count":0}