{"author":[],"actions":[],"building_block_type":"default","created_at":"2020-11-24T23:17:10.883Z","updated_at":"2020-11-24T23:17:38.041Z","created_by":"elastic","description":"Powershell.exe creating a network connection","enabled":true,"false_positives":[],"filters":[],"from":"now-3900s","id":"bd69222b-3d42-4211-a657-b128c5dd8306","immutable":false,"index":["winlogbeat-*"],"interval":"5m","rule_id":"6c8e50e3-6eb7-433e-92e6-4e4ac18c4eda","language":"kuery","license":"","output_index":".siem-signals-default","max_signals":100,"risk_score":21,"risk_score_mapping":[],"name":"Adversary Emulation - Powershell with Network Connection - Building Block","query":"process.name: \"powershell.exe\"  and event.category : network* and destination.geo.country_name : * ","references":[],"timeline_id":"91832785-286d-4ebe-b884-1a208d111a70","timeline_title":"Generic Network Timeline","meta":{"from":"1h","kibana_siem_app_url":"https://1373244808184bb6b1e4a01986d646c1.australia-southeast1.gcp.elastic-cloud.com/app/security"},"severity":"low","severity_mapping":[],"updated_by":"elastic","tags":[],"to":"now","type":"query","threat":[],"throttle":"no_actions","version":2,"exceptions_list":[]}
{"exported_count":1,"missing_rules":[],"missing_rules_count":0}
