{"author":[],"actions":[],"created_at":"2020-11-24T23:23:37.264Z","updated_at":"2020-11-24T23:28:55.577Z","created_by":"elastic","description":"Powershell.exe creating a network connection more than 5 times in a given period","enabled":true,"false_positives":[],"filters":[],"from":"now-3660s","id":"f4209211-038e-4b4b-b5dd-8307cc452fc1","immutable":false,"index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","winlogbeat-*"],"interval":"1m","rule_id":"46d787b1-d03a-410b-8fa3-6710e031e1e7","language":"kuery","license":"","output_index":".siem-signals-default","max_signals":100,"risk_score":21,"risk_score_mapping":[],"name":"Adversary Emulation - Powershell with Network Connection - Threshold","query":"rule.id: \"bd69222b-3d42-4211-a657-b128c5dd8306\"","references":[],"meta":{"from":"1h","kibana_siem_app_url":"https://1373244808184bb6b1e4a01986d646c1.australia-southeast1.gcp.elastic-cloud.com/app/security"},"severity":"low","severity_mapping":[],"updated_by":"elastic","tags":[],"to":"now","type":"threshold","threat":[],"threshold":{"field":"_id","value":5},"throttle":"no_actions","version":1,"exceptions_list":[]}
{"exported_count":1,"missing_rules":[],"missing_rules_count":0}
