{"author":[],"actions":[],"created_at":"2020-11-25T05:13:45.642Z","updated_at":"2020-11-25T05:52:49.125Z","created_by":"elastic","description":"Adversary Emulation - Powershell with Network Connection - High Threshold","enabled":true,"false_positives":[],"filters":[],"from":"now-3660s","id":"d35b3b9d-e72f-49b4-9dc9-d17b2f2ad32c","immutable":false,"index":["logs-*","packetbeat-*","winlogbeat-*"],"interval":"1m","rule_id":"1a026af3-fa0a-482c-94dd-64d36d4e75c1","language":"kuery","license":"","output_index":".siem-signals-default","max_signals":100,"risk_score":21,"risk_score_mapping":[],"name":"Adversary Emulation - Powershell with Network Connection - High Threshold","query":"process.name: \"powershell.exe\"  and event.category : network* and destination.geo.country_name : * ","references":[],"meta":{"from":"1h","kibana_siem_app_url":"https://4e9dddee84454b26ab2ba4321c00cc30.australia-southeast1.gcp.elastic-cloud.com/app/security"},"severity":"low","severity_mapping":[],"updated_by":"elastic","tags":["aptelk"],"to":"now","type":"threshold","threat":[],"threshold":{"field":"host.hostname","value":30},"throttle":"no_actions","version":2,"exceptions_list":[]}
{"author":[],"actions":[],"created_at":"2020-11-25T04:12:32.159Z","updated_at":"2020-11-25T05:52:55.195Z","created_by":"elastic","description":"OS signed binaries used by attackers to evade detection\nPowershell writing a file then running a process that is unsigned finally where network event is true.","enabled":true,"false_positives":[],"filters":[],"from":"now-7260s","id":"4c368423-d9f1-43d5-80b7-96cb193e827d","immutable":false,"index":["logs-*","packetbeat-*","winlogbeat-*"],"interval":"1m","rule_id":"f21d0019-bf33-420f-a935-1b9923b7415a","language":"eql","license":"","output_index":".siem-signals-default","max_signals":100,"risk_score":20,"risk_score_mapping":[],"name":"Adversary Emulation - Powershell Writing a File","query":"sequence by host.name\n  [process where event.type == \"start\"\n    and process.name in\n     (\"powershell.exe\", \"mshta.exe\", \"installutil.exe\", \n      \"msxsl.exe\", \"rundll32.exe\")\n  ]\n[file where file.extension == \"exe\"]\n[process where process.code_signature.status != \"trusted\" and event.type == \"start\"]\n","references":[],"meta":{"from":"2h"},"severity":"low","severity_mapping":[],"updated_by":"elastic","tags":["aptelk"],"to":"now","type":"eql","threat":[],"throttle":"no_actions","version":3,"exceptions_list":[]}
{"author":[],"actions":[],"created_at":"2020-11-25T05:02:37.596Z","updated_at":"2020-11-25T05:53:26.916Z","created_by":"elastic","description":"OS signed binaries used by attackers to evade detection\nPowershell writing a file then running a process that is unsigned then where network event is true finally follow process tree until conhost.exe is spawned","enabled":true,"false_positives":[],"filters":[],"from":"now-7260s","id":"70f52e1e-2430-4d9e-81ba-96705d1ded1c","immutable":false,"index":["logs-*","packetbeat-*","winlogbeat-*"],"interval":"1m","rule_id":"37d38fb0-6d62-45c7-96a8-959e0843c5ec","language":"eql","license":"","output_index":".siem-signals-default","max_signals":100,"risk_score":21,"risk_score_mapping":[],"name":"Adversary Emulation - Powershell Writing a File Until Adversary Tool Is Executed","query":"sequence by host.name\n  [process where event.type == \"start\"\n    and process.name in (\"powershell.exe\", \"mshta.exe\", \"installutil.exe\",  \"msxsl.exe\", \"rundll32.exe\") ]\n[file where file.extension == \"exe\"]\n[process where process.code_signature.status != \"trusted\" and event.type== \"start\"]\n  until \n[ process where process.name in (\"conhost.exe\", \"wmic.exe\", \"whoami.exe\")]","references":[],"meta":{"from":"2h","kibana_siem_app_url":"https://1373244808184bb6b1e4a01986d646c1.australia-southeast1.gcp.elastic-cloud.com/app/security"},"severity":"low","severity_mapping":[],"updated_by":"elastic","tags":["aptelk"],"to":"now","type":"eql","threat":[],"throttle":"no_actions","version":5,"exceptions_list":[]}
{"exported_count":3,"missing_rules":[],"missing_rules_count":0}
